<a href="https://colab.research.google.com/github/TheMLEngineer/Data-Analysis-Book-wes-mckinney-/blob/master/Chapter_6_Data_Loading_%2C_Storage_%2C_File_Formats.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [0]:
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [468]:
ls

'Chapter 3.ipynb'
 Chapter4_NumPy.ipynb
'Chapter5_Pandas (1).ipynb'
 Chapter5_Pandas.ipynb
'Chapter 6 Data Loading , Storage , File Formats.ipynb'
 csv_mindex.csv
 ex1.csv
 ex1.xlsx
 ex2.csv
 ex2.xlsx
 ex3.txt
 ex4.csv
 ex5.csv
 ex6.csv
 ex7.csv
 example.json
 fdic_failed_bank_list.html
 frame_pickle
 iris.csv
 mydata1.h5
 my_data.csv
 mydata.h5
 mydata.sqlite
 np_rx_ofdm_entries.hdf5
 out.csv
 rows.xml
 tseries.csv
 Untitled0.ipynb
 Untitled.ipynb

In [469]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [470]:
ls

'Chapter 3.ipynb'
 Chapter4_NumPy.ipynb
'Chapter5_Pandas (1).ipynb'
 Chapter5_Pandas.ipynb
'Chapter 6 Data Loading , Storage , File Formats.ipynb'
 csv_mindex.csv
 ex1.csv
 ex1.xlsx
 ex2.csv
 ex2.xlsx
 ex3.txt
 ex4.csv
 ex5.csv
 ex6.csv
 ex7.csv
 example.json
 fdic_failed_bank_list.html
 frame_pickle
 iris.csv
 mydata1.h5
 my_data.csv
 mydata.h5
 mydata.sqlite
 np_rx_ofdm_entries.hdf5
 out.csv
 rows.xml
 tseries.csv
 Untitled0.ipynb
 Untitled.ipynb

In [471]:
cd drive

[Errno 2] No such file or directory: 'drive'
/content/drive/My Drive/Colab Notebooks/Data Analysis Book

In [472]:
ls

'Chapter 3.ipynb'
 Chapter4_NumPy.ipynb
'Chapter5_Pandas (1).ipynb'
 Chapter5_Pandas.ipynb
'Chapter 6 Data Loading , Storage , File Formats.ipynb'
 csv_mindex.csv
 ex1.csv
 ex1.xlsx
 ex2.csv
 ex2.xlsx
 ex3.txt
 ex4.csv
 ex5.csv
 ex6.csv
 ex7.csv
 example.json
 fdic_failed_bank_list.html
 frame_pickle
 iris.csv
 mydata1.h5
 my_data.csv
 mydata.h5
 mydata.sqlite
 np_rx_ofdm_entries.hdf5
 out.csv
 rows.xml
 tseries.csv
 Untitled0.ipynb
 Untitled.ipynb

In [473]:
cd 'My Drive'

[Errno 2] No such file or directory: 'My Drive'
/content/drive/My Drive/Colab Notebooks/Data Analysis Book

In [474]:
ls

'Chapter 3.ipynb'
 Chapter4_NumPy.ipynb
'Chapter5_Pandas (1).ipynb'
 Chapter5_Pandas.ipynb
'Chapter 6 Data Loading , Storage , File Formats.ipynb'
 csv_mindex.csv
 ex1.csv
 ex1.xlsx
 ex2.csv
 ex2.xlsx
 ex3.txt
 ex4.csv
 ex5.csv
 ex6.csv
 ex7.csv
 example.json
 fdic_failed_bank_list.html
 frame_pickle
 iris.csv
 mydata1.h5
 my_data.csv
 mydata.h5
 mydata.sqlite
 np_rx_ofdm_entries.hdf5
 out.csv
 rows.xml
 tseries.csv
 Untitled0.ipynb
 Untitled.ipynb

In [475]:
cd 'Colab Notebooks'

[Errno 2] No such file or directory: 'Colab Notebooks'
/content/drive/My Drive/Colab Notebooks/Data Analysis Book

In [476]:
ls

'Chapter 3.ipynb'
 Chapter4_NumPy.ipynb
'Chapter5_Pandas (1).ipynb'
 Chapter5_Pandas.ipynb
'Chapter 6 Data Loading , Storage , File Formats.ipynb'
 csv_mindex.csv
 ex1.csv
 ex1.xlsx
 ex2.csv
 ex2.xlsx
 ex3.txt
 ex4.csv
 ex5.csv
 ex6.csv
 ex7.csv
 example.json
 fdic_failed_bank_list.html
 frame_pickle
 iris.csv
 mydata1.h5
 my_data.csv
 mydata.h5
 mydata.sqlite
 np_rx_ofdm_entries.hdf5
 out.csv
 rows.xml
 tseries.csv
 Untitled0.ipynb
 Untitled.ipynb

In [477]:
cd 'Data Analysis Book'

[Errno 2] No such file or directory: 'Data Analysis Book'
/content/drive/My Drive/Colab Notebooks/Data Analysis Book

In [478]:
ls

'Chapter 3.ipynb'
 Chapter4_NumPy.ipynb
'Chapter5_Pandas (1).ipynb'
 Chapter5_Pandas.ipynb
'Chapter 6 Data Loading , Storage , File Formats.ipynb'
 csv_mindex.csv
 ex1.csv
 ex1.xlsx
 ex2.csv
 ex2.xlsx
 ex3.txt
 ex4.csv
 ex5.csv
 ex6.csv
 ex7.csv
 example.json
 fdic_failed_bank_list.html
 frame_pickle
 iris.csv
 mydata1.h5
 my_data.csv
 mydata.h5
 mydata.sqlite
 np_rx_ofdm_entries.hdf5
 out.csv
 rows.xml
 tseries.csv
 Untitled0.ipynb
 Untitled.ipynb

In [479]:
!cat '/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex1.csv'

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [0]:
df = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex1.csv')

In [481]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [482]:
pd.read_table('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex1.csv' , sep = ',')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [0]:
#A file will not always have a header

In [484]:
! cat '/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex2.csv'

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [485]:
pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex2.csv' , header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [486]:
pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex2.csv' , names = ['a' , 'b' , 'c' , 'd' , 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [0]:
 names = ['a' , 'b' , 'c' , 'd' , 'message']

In [488]:
pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex2.csv' , names = names , index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [489]:
! cat '/content/drive/My Drive/Colab Notebooks/Data Analysis Book/csv_mindex.csv'

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [490]:
pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/csv_mindex.csv' , index_col = ['key1' , 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [491]:
list(open('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [492]:
result = pd.read_table('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex3.txt' , sep = '\s+')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [493]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [494]:
!cat '/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex4.csv'

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [495]:
pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex4.csv' , skiprows= [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [496]:
!cat '/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex5.csv'

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [0]:
result = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex5.csv')

In [498]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [499]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [0]:
result = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex5.csv' , na_values=['NULL'])

In [501]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [502]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex5.csv' , na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [0]:
pd.options.display.max_rows = 10

In [0]:
result = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex6.csv')

In [505]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [506]:
pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex6.csv' , nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [0]:
chunker = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex6.csv' , chunksize=1000)

In [508]:
chunker

In [0]:
tot = pd.Series([])

In [510]:
for piece in chunker:
  print(piece)

          one       two     three      four key
0    0.467976 -0.038649 -0.295344 -1.824726   L
1   -0.358893  1.404453  0.704965 -0.200638   B
2   -0.501840  0.659254 -0.421691 -0.057688   G
3    0.204886  1.074134  1.388361 -0.982404   R
4    0.354628 -0.133116  0.283763 -0.837063   Q
..        ...       ...       ...       ...  ..
995  2.311896 -0.417070 -1.409599 -0.515821   M
996 -0.479893 -0.650419  0.745152 -0.646038   H
997  0.523331  0.787112  0.486066  1.093156   D
998 -0.362559  0.598894 -1.843201  0.887292   W
999 -0.096376 -1.012999 -0.657431 -0.573315   K

[1000 rows x 5 columns]
           one       two     three      four key
1000  0.467976 -0.038649 -0.295344 -1.824726   T
1001 -0.358893  1.404453  0.704965 -0.200638   J
1002 -0.501840  0.659254 -0.421691 -0.057688   R
1003  0.204886  1.074134  1.388361 -0.982404   S
1004  0.354628 -0.133116  0.283763 -0.837063   B
...        ...       ...       ...       ...  ..
1995  2.311896 -0.417070 -1.409599 -0.515821   L
1996 -0.479893 -0.650419  0.745152 -0.646038   J
1997  0.523331  0.787112  0.486066  1.093156   V
1998 -0.362559  0.598894 -1.843201  0.887292   W
1999 -0.096376 -1.012999 -0.657431 -0.573315   D

[1000 rows x 5 columns]
           one       two     three      four key
2000  0.467976 -0.038649 -0.295344 -1.824726   1
2001 -0.358893  1.404453  0.704965 -0.200638   H
2002 -0.501840  0.659254 -0.421691 -0.057688   F
2003  0.204886  1.074134  1.388361 -0.982404   L
2004  0.354628 -0.133116  0.283763 -0.837063   E
...        ...       ...       ...       ...  ..
2995  2.311896 -0.417070 -1.409599 -0.515821   H
2996 -0.479893 -0.650419  0.745152 -0.646038   U
2997  0.523331  0.787112  0.486066  1.093156   A
2998 -0.362559  0.598894 -1.843201  0.887292   Y
2999 -0.096376 -1.012999 -0.657431 -0.573315   F

[1000 rows x 5 columns]
           one       two     three      four key
3000  0.467976 -0.038649 -0.295344 -1.824726   H
3001 -0.358893  1.404453  0.704965 -0.200638   Y
3002 -0.501840  0.659254 -0.421691 -0.057688   0
3003  0.204886  1.074134  1.388361 -0.982404   Z
3004  0.354628 -0.133116  0.283763 -0.837063   U
...        ...       ...       ...       ...  ..
3995  2.311896 -0.417070 -1.409599 -0.515821   W
3996 -0.479893 -0.650419  0.745152 -0.646038   E
3997  0.523331  0.787112  0.486066  1.093156   Q
3998 -0.362559  0.598894 -1.843201  0.887292   A
3999 -0.096376 -1.012999 -0.657431 -0.573315   M

[1000 rows x 5 columns]
           one       two     three      four key
4000  0.467976 -0.038649 -0.295344 -1.824726   H
4001 -0.358893  1.404453  0.704965 -0.200638   Z
4002 -0.501840  0.659254 -0.421691 -0.057688   2
4003  0.204886  1.074134  1.388361 -0.982404   B
4004  0.354628 -0.133116  0.283763 -0.837063   1
...        ...       ...       ...       ...  ..
4995  2.311896 -0.417070 -1.409599 -0.515821   X
4996 -0.479893 -0.650419  0.745152 -0.646038   M
4997  0.523331  0.787112  0.486066  1.093156   5
4998 -0.362559  0.598894 -1.843201  0.887292   T
4999 -0.096376 -1.012999 -0.657431 -0.573315   U

[1000 rows x 5 columns]
           one       two     three      four key
5000  0.467976 -0.038649 -0.295344 -1.824726   1
5001 -0.358893  1.404453  0.704965 -0.200638   Z
5002 -0.501840  0.659254 -0.421691 -0.057688   3
5003  0.204886  1.074134  1.388361 -0.982404   H
5004  0.354628 -0.133116  0.283763 -0.837063   B
...        ...       ...       ...       ...  ..
5995  2.311896 -0.417070 -1.409599 -0.515821   1
5996 -0.479893 -0.650419  0.745152 -0.646038   Y
5997  0.523331  0.787112  0.486066  1.093156   F
5998 -0.362559  0.598894 -1.843201  0.887292   0
5999 -0.096376 -1.012999 -0.657431 -0.573315   3

[1000 rows x 5 columns]
           one       two     three      four key
6000  0.467976 -0.038649 -0.295344 -1.824726   I
6001 -0.358893  1.404453  0.704965 -0.200638   X
6002 -0.501840  0.659254 -0.421691 -0.057688   A
6003  0.204886  1.074134  1.388361 -0.982404   C
6004  0.354628 -0.133116  0.283763 -0.837063   S
...        ...       ...       ...       ...  ..
6995  2.311896 -0.417070 -1.409599 -0.515821   P
6996 -0.479893 -0.650419  0.745152 -0.646038   9
6997  0.523331  0.787112  0.486066  1.093156   L
6998 -0.362559  0.598894 -1.843201  0.887292   5
6999 -0.096376 -1.012999 -0.657431 -0.573315   O

[1000 rows x 5 columns]
           one       two     three      four key
7000  0.467976 -0.038649 -0.295344 -1.824726   1
7001 -0.358893  1.404453  0.704965 -0.200638   I
7002 -0.501840  0.659254 -0.421691 -0.057688   H
7003  0.204886  1.074134  1.388361 -0.982404   P
7004  0.354628 -0.133116  0.283763 -0.837063   D
...        ...       ...       ...       ...  ..
7995  2.311896 -0.417070 -1.409599 -0.515821   A
7996 -0.479893 -0.650419  0.745152 -0.646038   6
7997  0.523331  0.787112  0.486066  1.093156   R
7998 -0.362559  0.598894 -1.843201  0.887292   R
7999 -0.096376 -1.012999 -0.657431 -0.573315   2

[1000 rows x 5 columns]
           one       two     three      four key
8000  0.467976 -0.038649 -0.295344 -1.824726   7
8001 -0.358893  1.404453  0.704965 -0.200638   W
8002 -0.501840  0.659254 -0.421691 -0.057688   C
8003  0.204886  1.074134  1.388361 -0.982404   S
8004  0.354628 -0.133116  0.283763 -0.837063   H
...        ...       ...       ...       ...  ..
8995  2.311896 -0.417070 -1.409599 -0.515821   W
8996 -0.479893 -0.650419  0.745152 -0.646038   N
8997  0.523331  0.787112  0.486066  1.093156   Q
8998 -0.362559  0.598894 -1.843201  0.887292   R
8999 -0.096376 -1.012999 -0.657431 -0.573315   M

[1000 rows x 5 columns]
           one       two     three      four key
9000  0.467976 -0.038649 -0.295344 -1.824726   B
9001 -0.358893  1.404453  0.704965 -0.200638   M
9002 -0.501840  0.659254 -0.421691 -0.057688   N
9003  0.204886  1.074134  1.388361 -0.982404   N
9004  0.354628 -0.133116  0.283763 -0.837063   Y
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[1000 rows x 5 columns]

In [0]:
for piece in chunker:
  tot = tot.add(piece['key'].value_counts() , fill_value= 0)

In [0]:
tot = tot.sort_values(ascending=False)

In [513]:
tot

Series([], dtype: float64)

In [0]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [515]:
tot[:10]

Series([], dtype: float64)

In [0]:
#Writing data to text format

In [0]:
data = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex5.csv')

In [518]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [0]:
data.to_csv('out.csv')

In [520]:
!cat out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [0]:
import sys

In [522]:
data.to_csv(sys.stdout , sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [523]:
data.to_csv(sys.stdout , sep = '#')

#something#a#b#c#d#message
0#one#1#2#3.0#4#
1#two#5#6##8#world
2#three#9#10#11.0#12#foo

In [524]:
data.to_csv(sys.stdout , na_rep= 'NaN')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NaN
1,two,5,6,NaN,8,world
2,three,9,10,11.0,12,foo

In [525]:
data.to_csv(sys.stdout , index=False , header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [526]:
data.to_csv(sys.stdout , index=False , columns = ['a' , 'b' , 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [527]:
pd.date_range('1/1/2020' , periods=7)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07'],
              dtype='datetime64[ns]', freq='D')

In [0]:
dates = pd.date_range('1/1/2020' , periods=7)

In [0]:
ts = pd.Series(np.arange(7) , index = dates)

In [530]:
ts

2020-01-01    0
2020-01-02    1
2020-01-03    2
2020-01-04    3
2020-01-05    4
2020-01-06    5
2020-01-07    6
Freq: D, dtype: int64

In [531]:
ts.to_csv('tseries.csv')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [532]:
!cat tseries.csv

2020-01-01,0
2020-01-02,1
2020-01-03,2
2020-01-04,3
2020-01-05,4
2020-01-06,5
2020-01-07,6

In [533]:
!cat '/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex7.csv'

"a","b","c"
"1","2","3"
"1","2","3"

In [0]:
import csv

In [0]:
f = open('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex7.csv')

In [0]:
a = csv.reader(f)

In [537]:
a

In [538]:
for i in a:
  print(i)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [0]:
with open('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex7.csv') as f:
  lines = list(csv.reader(f))

In [540]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [0]:
header , values = lines[0] , lines[1:]

In [542]:
header

['a', 'b', 'c']

In [543]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [544]:
{h:v for h , v in zip(header , values)}

{'a': ['1', '2', '3'], 'b': ['1', '2', '3']}

In [545]:
{h:v for h , v in zip(header , zip(values))}

{'a': (['1', '2', '3'],), 'b': (['1', '2', '3'],)}

In [546]:
{h:v for h , v in zip(header , zip(*values))}

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [0]:
class my_dialect(csv.Dialect):
  lineterminator = '\n'
  delimiter = ';'
  quotechar = '"'
  quoting = csv.QUOTE_MINIMAL

In [0]:
f = open(1)

In [0]:
reader = csv.reader(f , dialect = my_dialect)

In [550]:
reader

In [551]:
for i in reader:
  print(i)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [0]:
reader = csv.reader(f , delimiter = '|')

In [0]:
with open('my_data.csv' , 'w') as f:
  writer_obj = csv.writer(f , dialect = my_dialect)
  writer_obj.writerow(('one' , 'two' , 'three'))
  writer_obj.writerow(('1' , '2' , '3'))
  writer_obj.writerow(('4' , '5' , '6'))
  writer_obj.writerow(('7' , '8' , '9'))

In [554]:
!cat my_data.csv

one;two;three
1;2;3
4;5;6
7;8;9

In [0]:
#JSON Data

In [0]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [0]:
import json

In [0]:
result = json.loads(obj)

In [559]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [0]:
asjson = json.dumps(result)

In [561]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [562]:
result['siblings']

[{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
 {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]

In [0]:
siblings = pd.DataFrame(result['siblings'] , columns = ['name' , 'age'])

In [564]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [565]:
!cat '/content/drive/My Drive/Colab Notebooks/Data Analysis Book/example.json'

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [0]:
data = pd.read_json('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/example.json')

In [567]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [568]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [569]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [570]:
pip install beautifulsoup4

Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.6/dist-packages (4.6.3)

In [0]:
tables = pd.read_html('/content/drive/My Drive/Colab Notebooks/Data Analysis Book//fdic_failed_bank_list.html')

In [572]:
tables

[                             Bank Name  ...       Updated Date
 0                          Allied Bank  ...  November 17, 2016
 1         The Woodbury Banking Company  ...  November 17, 2016
 2               First CornerStone Bank  ...  September 6, 2016
 3                   Trust Company Bank  ...  September 6, 2016
 4           North Milwaukee State Bank  ...      June 16, 2016
 ..                                 ...  ...                ...
 542                 Superior Bank, FSB  ...    August 19, 2014
 543                Malta National Bank  ...  November 18, 2002
 544    First Alliance Bank & Trust Co.  ...  February 18, 2003
 545  National State Bank of Metropolis  ...     March 17, 2005
 546                   Bank of Honolulu  ...     March 17, 2005

 [547 rows x 7 columns]]

In [573]:
len(tables)

1

In [0]:
failures = tables[0]

In [575]:
failures

                             Bank Name  ...       Updated Date
0                          Allied Bank  ...  November 17, 2016
1         The Woodbury Banking Company  ...  November 17, 2016
2               First CornerStone Bank  ...  September 6, 2016
3                   Trust Company Bank  ...  September 6, 2016
4           North Milwaukee State Bank  ...      June 16, 2016
..                                 ...  ...                ...
542                 Superior Bank, FSB  ...    August 19, 2014
543                Malta National Bank  ...  November 18, 2002
544    First Alliance Bank & Trust Co.  ...  February 18, 2003
545  National State Bank of Metropolis  ...     March 17, 2005
546                   Bank of Honolulu  ...     March 17, 2005

[547 rows x 7 columns]

In [576]:
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [0]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [578]:
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [579]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [0]:
from lxml import objectify

In [0]:
path = '/content/drive/My Drive/Colab Notebooks/Data Analysis Book/rows.xml'

In [0]:
parsed = objectify.parse(open(path))

In [583]:
parsed

In [0]:
root = parsed.getroot()

In [585]:
root

In [0]:
from io import StringIO

In [0]:
tag = '<a href =  "https://google.com">Google</a>'

In [588]:
tag

'<a href =  "https://google.com">Google</a>'

In [0]:
root = objectify.parse(StringIO(tag)).getroot()

In [590]:
root

In [591]:
root.get('href')

'https://google.com'

In [592]:
root.text

'Google'

In [0]:
frame = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex1.csv')

In [594]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [0]:
frame.to_pickle('frame_pickle')

In [596]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [597]:


frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/np_rx_ofdm_entries.hdf5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: /content/drive/My Drive/Colab Notebooks/Data Analysis Book/np_rx_ofdm_entries.hdf5

In [598]:
store['obj1']

           a
0  -0.204708
1   0.478943
2  -0.519439
3  -0.555730
4   1.965781
..       ...
95  0.795253
96  0.118110
97 -0.748532
98  0.584970
99  0.152677

[100 rows x 1 columns]

In [599]:


store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.007189
11 -1.296221
12  0.274992
13  0.228913
14  1.352917
15  0.886429

In [0]:
store.close()

In [601]:


frame.to_hdf('mydata1.h5', 'obj3', format='table')
pd.read_hdf('mydata1.h5', 'obj3', where=['index < 5'])

          a
0 -0.204708
1  0.478943
2 -0.519439
3 -0.555730
4  1.965781

In [0]:
xlsx = pd.ExcelFile('/content/drive/My Drive/Colab Notebooks/Data Analysis Book/ex1.xlsx')

In [603]:
pd.read_excel(xlsx , 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [604]:
frame = pd.read_excel(xlsx , 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [0]:
writer = pd.ExcelWriter('ex2.xlsx')

In [0]:
frame.to_excel(writer , 'Sheet1')

In [0]:
writer.save()

In [0]:
frame.to_excel('ex2.xlsx')

In [0]:
import requests

In [0]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [0]:
response = requests.get(url)

In [612]:
response

In [0]:
data = response.json()

In [614]:
data[0]

{'assignee': None,
 'assignees': [],
 'author_association': 'MEMBER',
 'body': 'http://ndb.nal.usda.gov/ndb/foods/show/300772?fg=&man=&lfacet=&format=&count=&max=25&offset=&sort=&qlookup=spam\r\n\r\n![image](https://user-images.githubusercontent.com/13159005/65956425-43530700-e442-11e9-8dfb-5f053be9f0fb.png)\r\n',
 'closed_at': None,
 'comments': 0,
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/28708/comments',
 'created_at': '2019-10-01T10:56:09Z',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/28708/events',
 'html_url': 'https://github.com/pandas-dev/pandas/issues/28708',
 'id': 500818898,
 'labels': [{'color': 'a2bca7',
   'default': False,
   'id': 48070600,
   'name': 'CI',
   'node_id': 'MDU6TGFiZWw0ODA3MDYwMA==',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/CI'}],
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/28708/labels{/name}',
 'locked': False,
 'milestone': None,
 'node_id': 'MDU6SXNzdWU1MDA4MTg4OTg=',
 'number': 28708,
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'state': 'open',
 'title': 'CI Failing: TestReadHtml.test_spam_url',
 'updated_at': '2019-10-01T10:56:09Z',
 'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/28708',
 'user': {'avatar_url': 'https://avatars0.githubusercontent.com/u/13159005?v=4',
  'events_url': 'https://api.github.com/users/simonjayhawkins/events{/privacy}',
  'followers_url': 'https://api.github.com/users/simonjayhawkins/followers',
  'following_url': 'https://api.github.com/users/simonjayhawkins/following{/other_user}',
  'gists_url': 'https://api.github.com/users/simonjayhawkins/gists{/gist_id}',
  'gravatar_id': '',
  'html_url': 'https://github.com/simonjayhawkins',
  'id': 13159005,
  'login': 'simonjayhawkins',
  'node_id': 'MDQ6VXNlcjEzMTU5MDA1',
  'organizations_url': 'https://api.github.com/users/simonjayhawkins/orgs',
  'received_events_url': 'https://api.github.com/users/simonjayhawkins/received_events',
  'repos_url': 'https://api.github.com/users/simonjayhawkins/repos',
  'site_admin': False,
  'starred_url': 'https://api.github.com/users/simonjayhawkins/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/simonjayhawkins/subscriptions',
  'type': 'User',
  'url': 'https://api.github.com/users/simonjayhawkins'}}

In [615]:
data[0]['title']

'CI Failing: TestReadHtml.test_spam_url'

In [0]:
issues = pd.DataFrame(data , columns=['number', 'title', 'labels', 'state'])

In [617]:
issues

    number  ... state
0    28708  ...  open
1    28707  ...  open
2    28706  ...  open
3    28705  ...  open
4    28704  ...  open
..     ...  ...   ...
25   28678  ...  open
26   28677  ...  open
27   28676  ...  open
28   28675  ...  open
29   28674  ...  open

[30 rows x 4 columns]

In [0]:
import sqlite3
query = """
CREATE TABLE test1
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [621]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)

In [0]:
con.commit()

In [0]:
cursor = con.execute('select * from test1')

In [0]:
rows = cursor.fetchall()

In [625]:
rows

[]

In [626]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [627]:
rows

[]

In [628]:
pd.DataFrame(rows , columns= [x[0] for x in cursor.description])

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [0]:
import sqlalchemy as sqla

In [0]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [631]:
pd.read_sql('select * from test1' , db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []